wsdl/HPD_ProviderInformationDirectory.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions name="HPDProviderInformationDirectory"
    targetNamespace="urn:ihe:iti:hpd:2010" 
    xmlns:tns="urn:ihe:iti:hpd:2010" 
    xmlns="http://schemas.xmlsoap.org/wsdl/" 
    xmlns:dsml="urn:oasis:names:tc:DSML:2:0:core" 
    xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" 
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap12/" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <documentation>IHE HPD Provider Information Directory</documentation>
    <types>
        <xsd:schema 
            targetNamespace="urn:oasis:names:tc:DSML:2:0:core"
            xmlns:dsml="urn:oasis:names:tc:DSML:2:0:core">
            <xsd:include schemaLocation="../schema/DSML/DSMLv2.xsd"/>
        </xsd:schema>
    </types>
    <message name="ProviderInformationRequestMessage">
        <documentation>Provider Information Query/Feed Request Message</documentation>
        <part name="body" element="dsml:batchRequest" />
    </message>
    <message name="ProviderInformationResponseMessage">
        <documentation>Provider Information Query/Feed ResponseMessage</documentation>
        <part name="body" element="dsml:batchResponse"/>
    </message>
    <portType name="ProviderInformationDirectory_PortType">
        <operation name="ProviderInformationQueryRequest">
            <input message="tns:ProviderInformationRequestMessage"
               wsaw:Action="urn:ihe:iti:2010:ProviderInformationQuery"/>
            <output message="tns:ProviderInformationResponseMessage"
               wsaw:Action="urn:ihe:iti:2010:ProviderInformationQueryResponse"/>
        </operation>
        <operation name="ProviderInformationFeedRequest">
            <input message="tns:ProviderInformationRequestMessage"
               wsaw:Action="urn:ihe:iti:2010:ProviderInformationFeed"/>
            <output message="tns:ProviderInformationResponseMessage"
               wsaw:Action="urn:ihe:iti:2010:ProviderInformationFeedResponse"/>
        </operation>
    </portType>
    <binding name="ProviderInformationDirectory_Binding"
        type="tns:ProviderInformationDirectory_PortType">
        <soap:binding style="document"
            transport="http://schemas.xmlsoap.org/soap/http" />
        <operation name="ProviderInformationQueryRequest">
            <soap:operation
                soapAction="urn:ihe:iti:hpd:2010:ProviderInformationQueryRequest" />
            <input>
                <soap:body use="literal" />
            </input>
            <output>
                <soap:body use="literal" />
            </output>
        </operation>
        <operation name="ProviderInformationFeedRequest">
            <soap:operation
                soapAction="urn:ihe:iti:hpd:2010:ProviderInformationFeedRequest" />
            <input>
                <soap:body use="literal" />
            </input>
            <output>
                <soap:body use="literal" />
            </output>
        </operation>
    </binding>
    <service name="ProviderInformationDirectory_Service">
        <port name="ProviderInformationDirectory_Port_Soap" binding="tns:ProviderInformationDirectory_Binding">
            <soap:address location="https://localhost:${HttpsDefaultPort}/ProvoderInformationDirectoryService"/>
        </port>
    </service>
</definitions>

