opendj3-server-dev/tests/staf-tests/functional-tests/shared/data/dsml/suites/03dsmlerrsuite/data/modify_errtag1.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 590
SOAPAction: batchRequest

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap-env:Body>
<batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core"
   requestID="[modifyRequest] start element is mispelled"
   >
<modify_BOGUS dn="uid=abergin,ou=People,dc=siroe,dc=com">
<modification name="givenname" operation="replace">
<value>John</value>
</modification>
</modifyRequest>
</batchRequest>
</soap-env:Body>
</soap-env:Envelope>
